
#include <stdio.h>

int main()
{
	int i, j;
	double temp = 0; //一時保存変数

	double kousui[4][12] =
	{ {69.5, 59.0, 64.5, 135.0, 149.0, 579.0, 223.0, 2.0, 574.0, 200.0, 88.5, 55.0},
	   {55.5, 24.5, 82.0, 144.5, 112.0, 160.0, 203.0, 82.5, 389.5, 620.5, 33.0, 3.0},
	   {42.0, 44.0, 150.0, 54.5, 118.0, 288.0, 286.0, 38.0, 446.5, 92.5, 41.5, 62.0},
		{35.5, 87.0, 189.0, 84.0, 69.0, 236.5, 353.0, 382.0, 98.0, 107.5, 18.5, 93.0} };

	for (i = 0; i < 4; i++)
	{
		for (j = 0; j < 12; j++)
		{
			//tempにその年の降水量を全て足す
			temp += kousui[i][j];
		}
		//その年の降水量を出力し、tempを0にリセット
		printf("%d年の降水量合計%.1lf[mm]\n", i + 2016, temp);
		temp = 0;

	}

	for (i = 0; i < 12; i++)
	{
		for (j = 0; j < 4; j++)
		{
			//tempにその月の降水量を全て足す
			temp += kousui[j][i];
		}
		//その月の降水量の平均を求めるため4で割り出力、tempをリセット
		printf("%d月の降水量平均%.1lf[mm]\n", i + 1, temp / 4.0);
		temp = 0;
	}
	return 0;
}


